<details><summary>Show OpenTofu Plan</summary>

```


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # openstack_dns_recordset_v2.legacy_prod_app6 has moved to module.dns_app_legacy.openstack_dns_recordset_v2.a
    resource "openstack_dns_recordset_v2" "a" {
        id                   = "22fe5641-3813-47bf-b6ab-c6d17c1962c1/5dfaa783-307f-4b85-86da-ba2754754963"
        name                 = "app-legacy.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
        # (7 unchanged attributes hidden)
    }

  # module.dns_app_legacy.openstack_dns_recordset_v2.aaaa[0] will be created
  + resource "openstack_dns_recordset_v2" "aaaa" {
      + disable_status_check = false
      + id                   = (known after apply)
      + name                 = "app-legacy.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
      + project_id           = (known after apply)
      + records              = [
          + "2a02:ec80:a000:1::394",
        ]
      + region               = (known after apply)
      + ttl                  = 900
      + type                 = "AAAA"
      + zone_id              = "22fe5641-3813-47bf-b6ab-c6d17c1962c1"
    }

  # openstack_dns_recordset_v2.legacy_prod_db has moved to module.dns_db_legacy.openstack_dns_recordset_v2.a
    resource "openstack_dns_recordset_v2" "a" {
        id                   = "22fe5641-3813-47bf-b6ab-c6d17c1962c1/131afdc6-c46a-46d5-99e0-6e6da3bf3ecb"
        name                 = "db-legacy.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
        # (7 unchanged attributes hidden)
    }

  # openstack_dns_recordset_v2.test11 has moved to module.dns_test11.openstack_dns_recordset_v2.a
    resource "openstack_dns_recordset_v2" "a" {
        id                   = "22fe5641-3813-47bf-b6ab-c6d17c1962c1/5b537839-d9b0-464b-b4d8-7c9598799338"
        name                 = "test11.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
        # (6 unchanged attributes hidden)
    }

  # module.dns_test11.openstack_dns_recordset_v2.aaaa[0] will be created
  + resource "openstack_dns_recordset_v2" "aaaa" {
      + disable_status_check = false
      + id                   = (known after apply)
      + name                 = "test11.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
      + project_id           = (known after apply)
      + records              = [
          + "2a02:ec80:a000:1::cc",
        ]
      + region               = (known after apply)
      + ttl                  = 900
      + type                 = "AAAA"
      + zone_id              = "22fe5641-3813-47bf-b6ab-c6d17c1962c1"
    }

  # openstack_dns_recordset_v2.test12 has moved to module.dns_test12.openstack_dns_recordset_v2.a
    resource "openstack_dns_recordset_v2" "a" {
        id                   = "22fe5641-3813-47bf-b6ab-c6d17c1962c1/ffbf312f-05bf-4c5a-8e5b-e8ed3fdb79a8"
        name                 = "test12.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
        # (6 unchanged attributes hidden)
    }

  # module.dns_test12.openstack_dns_recordset_v2.aaaa[0] will be created
  + resource "openstack_dns_recordset_v2" "aaaa" {
      + disable_status_check = false
      + id                   = (known after apply)
      + name                 = "test12.svc.account-creation-assistance.eqiad1.wikimedia.cloud."
      + project_id           = (known after apply)
      + records              = [
          + "2a02:ec80:a000:1::88",
        ]
      + region               = (known after apply)
      + ttl                  = 900
      + type                 = "AAAA"
      + zone_id              = "22fe5641-3813-47bf-b6ab-c6d17c1962c1"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @stwalkerster, Action: `pull_request`*